app/Controllers/Auth.php


        $this->data['session'] = $session;
        $this->data['page_title'] = "Usuarios";
        $this->data['user'] = $this->auth_model->where("id ='{$session->login_id}'")->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1