app/Controllers/Main.php

SELECT *
FROM `products`
---
    public function eys()
    {
        $this->data['page_title'] = "Entradas y Salidas";
        $this->data['products'] =  $this->prod_model->findAll();