app/Controllers/Main.php

SELECT *
FROM `users`
WHERE `id` != '1'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` != '1'
---
    public function users()
    {
        $this->data['page_title'] = "Users";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->auth_model->where("id != '{$this->session->login_id}'")->countAllResults();
        $this->data['users'] = $this->auth_model->where("id != '{$this->session->login_id}'")->paginate($this->data['perPage']);

SELECT *
FROM `products`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function products()
    {
        $this->data['page_title'] = "Productos";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->prod_model->countAllResults();
        $this->data['products'] = $this->prod_model->paginate($this->data['perPage']);

SELECT *
FROM `products`
---
    public function pos()
    {
        $this->data['page_title'] = "Nueva Transacción";
        $this->data['products'] =  $this->prod_model->findAll();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
---
    public function transactions()
    {
        $this->data['page_title'] = "Transaciones";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->tran_model->countAllResults();
        $this->data['transactions'] = $this->tran_model
            ->select(" transactions.*, COALESCE((SELECT SUM(transaction_items.quantity) FROM transaction_items where transaction_id = transactions.id ), 0) as total_items")
            ->paginate($this->data['perPage']);

SELECT *
FROM `products`
---
    public function configuracion()
    {
        $this->data['page_title'] = "Datos de la Empresa";
        $this->data['products'] =  $this->prod_model->findAll();